# SequenceNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revision..::..SequenceNumber Property
Revision Class See Also
---
The Sequence Number of this Revision.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public int SequenceNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SequenceNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int SequenceNumber {
	int get ();
}
```

# Remarks
Every Revision in the project will be assigned a consecutive sequence number starting with 1. This number corresponds to the ordering of the Revisions. If a Revision is deleted, subsequent Revisions will update their sequence numbers to maintain a consecutive list.
# See Also
Revision Class
Autodesk.Revit.DB Namespace